tutorials/testcases/flowOverCylinder/cylinder_multiphase/2d/constant/LESProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      LESProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LESModel            SpalartAllmarasIDDES;

delta               cubeRootVol; //vanDriest;

printCoeffs         on;

laminarCoeffs
{
}

oneEqEddyCoeffs
{
    ck               0.07;
    ce               1.05;
}

dynOneEqEddyCoeffs
{
    ce               1.05;
    filter          simple;
}

locDynOneEqEddyCoeffs
{
    ce               1.05;
    filter          simple;
}

SmagorinskyCoeffs
{
    ce               1.05;
    ck               0.07;
}

Smagorinsky2Coeffs
{
    ce               1.05;
    ck               0.07;
    cD2              0.02;
}

spectEddyViscCoeffs
{
    ce               1.05;
    cB               8.22;
    cK1              0.83;
    cK2              1.03;
    cK3              4.75;
    cK4              2.55;
}

dynSmagorinskyCoeffs
{
    ce               1.05;
    filter          simple;
}

mixedSmagorinskyCoeffs
{
    ce               1.05;
    ck               0.07;
    filter          simple;
}

dynMixedSmagorinskyCoeffs
{
    ce               1.05;
    filter          simple;
}

LRRDiffStressCoeffs
{
    ce               1.05;
    ck               0.09;
    c1               1.8;
    c2               0.6;
}

DeardorffDiffStressCoeffs
{
    ce               1.05;
    ck               0.09;
    cm               4.13;
}

SpalartAllmarasCoeffs
{
    alphaNut         1.5;
    Cb1              0.1355;
    Cb2              0.622;
    Cw2              0.3;
    Cw3              2;
    Cv1              7.1;
    Cv2              5.0;
    CDES             0.65;
    ck               0.07;
}

SpalartAllmarasIDDESCoeffs
{
    delta IDDESDelta;
    IDDESDeltaCoeffs
    {
        deltaCoeff 1;
        cw 0.15;
    }
}

SpalartAllmarasIDDESCoeffs
{
     delta  IDDESDelta;

     IDDESDeltaCoeffs
     {
         deltaCoeff       1;

         //according to src/turbulenceModels/incompressible/LES/SpalartAllmarasIDDES/IDDESDelta/IDDESDelta.C
         cw               0.15;
     }

     alphaNut         1.5;
     kappa            0.4187;
     Cb1              0.1355;
     Cb2              0.622;
     Cw2              0.3;
     Cw3              2.0;
     Cv1              7.1;
     Cv2              5.0;
     CDES             0.65;
     ck               0.07;

//These are the default values
//     sigmaNut        0.66666;
//     kappa           0.41;
//     Cb1             0.1355;
//     Cb2             0.622;
//     Cv1             7.1;
//     Cv2             5;
//     CDES            0.65;
//     ck              0.07;
//     Cw2             0.3;
//     Cw3             2;
//     fwStar          0.424;
//     cl              3.55;
//     ct              1.63;
}

cubeRootVolCoeffs
{
    deltaCoeff      1;
}

PrandtlCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        maxDeltaRatio   1.1;
    }
    Cdelta           0.158;
}

vanDriestCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        maxDeltaRatio   1.1;
    }
    Aplus            26;
    Cdelta           0.158;
}

smoothCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }
    maxDeltaRatio   1.1;
}

kappa            0.4187;

wallFunctionCoeffs
{
    E                9;
}

// ************************************************************************* //
